#DocumentGenerate.py
import docx
from docx.shared import Pt
from docx.enum.text import WD_ALIGN_PARAGRAPH
import re
from .summarized_tools import generate_summary_gpt3

class DocumentGenerate():
    def __init__(self,dict):
        self.dict = dict

    def find_dict_value(self, pattern, dict):
        for keys in dict.keys():
            text = keys
            match = re.search(pattern, text)
            if match and match.group(0) != '' :
                if match.group(0) in dict:
                    new_header = match.group(0)
                    new_header = re.sub('/',' ', new_header)
                    if new_header == 'พฤติการณ์ในการจับกุม':
                        return dict[text].split("(ลงชื่อ)")[0]
                    else:
                        return dict[text]
        return ''

    def generate(self,name):
        header_patterns = [
        r"สถานที่บันทึก",
        r"วัน เดือน ปี ที่บันทึก",
        r"วัน เดือน ปี ที่จับกุม",
        r"สถานที่จับกุม",
        r"สถานที่เกิดเหตุ",
        r"ผู้ต้องหา",
        r"ของกลาง",
        r"ข้อหา",
        r"(?:พฤติการณ์ในการจับกุม|พฤติการณ์ในการตรวจค้นและจับกุม)"
        ]
        summary = generate_summary_gpt3(str(self.find_dict_value(header_patterns[-1],self.dict)))
        paragraphs_data = [
            {
                'topic': '๑. รายงานเหตุ',
                'content': '\n\t      ( ) ปริมาณของกลางยาเสพติดที่กำหนดไว้ ๙ ประเภท\n\
                ( ) ผู้ต้องหาที่เป็นข้าราชการ เจ้าหน้าที่ของรัฐ\n\
                ( ) มีลักษณะการทำงานเป็นเครือข่าย ขบวนการ หรือองค์กรอาชญากรรม\n\
                ( ) คดียาเสพติดที่น่าสนใจ เช่น เป็นผู้มีอิทธิพล และ อื่น ๆ\n\
                ( ) การตรวจสอบทรัพย์สินมูลค่า ๑,๐๐๐,๐๐๐ บาท ขึ้นไป\n'
            },
            {
                'topic': '๒. รับคำร้องทุกข์',
                'content': f'คดี(อาญาที่....) ประจำวันข้อ... {str(self.find_dict_value(header_patterns[0],self.dict))}'
            },
            {
                'topic': '๓. ข้อหา',
                'content': f'{str(self.find_dict_value(header_patterns[-2],self.dict))}'
            },
            {
                'topic': '๔. หัวหน้าชุดจับกุม',
                'content': '...'
            },
            {
                'topic': '๕. ผู้ต้องหา',
                'content': f'{str(self.find_dict_value(header_patterns[-4],self.dict))}'
            },
            {
                'topic': '๖. วัน เดือน ปี ที่เกิดเหตุ',
                'content': f'{str(self.find_dict_value(header_patterns[2],self.dict))} {str(self.find_dict_value(header_patterns[4],self.dict))}'
            },
            {
                'topic': '๗. สถานที่จับกุม',
                'content': f'{str(self.find_dict_value(header_patterns[3],self.dict))}'
            },
            {
                'topic': '๘. การยึดของกลาง',
                'content': f'\n\t{str(self.find_dict_value(header_patterns[-3],self.dict))}'
            },
                        {
                'topic': '๙. การยึด / อายัด และตรวจสอบทรัพย์สิน',
                'content': '\n\t...'
            },
            {
                'topic': '๑๐. พฤติการณ์ในการจับกุมโดยย่อ',
                'content': f'\n\t{summary}'
            },
        ]
        # Create a new document
        doc = docx.Document()

        # Set the default font for the document
        doc.styles['Normal'].font.name = "TH Sarabun New"
        doc.styles['Normal'].font.size = docx.shared.Pt(16)  # Set font size to 12pt

        doc.add_paragraph(f'ที่ (....(น.ศ).....) ลงวันที่ {str(self.find_dict_value(header_patterns[1],self.dict))} {str(self.find_dict_value(header_patterns[0],self.dict))}')
        font_name = "TH Sarabun New"

        for paragraph_data in paragraphs_data:
            # Add a paragraph with a bold topic
            paragraph = doc.add_paragraph()

            # Add the topic with the specified font and bold style
            topic = paragraph.add_run(paragraph_data['topic'])
            topic.bold = True
            topic.font.name = font_name
            topic.font.size = Pt(18)

            # Add a colon and a space after the topic
            paragraph.add_run(' ')

            # Add the content for the paragraph with the specified font
            content = paragraph.add_run(paragraph_data['content'])
            content.font.name = font_name
            content.font.size = Pt(16)

        # Save the document
        return doc.save(f'เอกสารเร่งด่วน_{name}.docx')

# d =    {
#         "คดีอาญาที่": "/25",
#         "ตำแหน่งที่พบของกลาง": "โทรศัพท์ยี่ห้อซัมซุง ของกลางลำดับที่ 1 พบวางอยู่บนโต๊ะภายในห้องนอนของผู้ถูกจับ และโทรศัพท์มือถือยี่ห้อแอปเปิล รุ่นไอโฟน ของกลางลำดับ 2 พบวางอยู่ในห้องน้ำภายในบ้านของผู้ถูกจับ ,โทรศัพท์มือถือยี่ห้อ หัวเหว่ย ของกลางลำดับที่ 3 พบวางอยู่บนเตียงนอนของผู้ถูกจับ",
#         "นามเจ้าพนักงานตำรวจ ภายใต้การอำนวยการของ": "พล.ต.ท.ชินภัทร สารสิน ผบช.ปส., พล.ต.ต.พรชัย เจริญวงศ์ รอง ผบช.ปส., พล.ต.ต.พันธนะ นุชนารถ ผบก.ขส., ,พ.ต.อ.พิศาล เอิบอาบ, พ.ต.อ.จิรพัฒน์ พรหมนอก, พ.ต.อ.ประภาพ ธิติศักดิ์ รอง ผบก.ขส.",
#         "บัญชีของกลางลำดับที่": "/25",
#         "บันทึกการตรวจค้นและจับกุม": "",
#         "ปจว.ข้อ": "เวลา น.",
#         "ผู้จับได้แจ้งสิทธิตามกฎหมายให้ผู้ถูกจับขณะถูกจับทราบดังต่อไปนี้": "1. มีสิทธิที่จะไม่ให้การหรือให้การก็ได้ 2. ถ้อยคำของผู้ถูกจับอาจใช้เป็นพยานหลักฐานในการพิจารณาคดีได้ 3. มีสิทธิพบทนายและปรึกษาทนายหรือผู้ซึ่งจะเป็นทนาย 4.ถ้าผู้ถูกจับประสงค์แจ้งให้ญาติหรือผู้ซึ่งตนไว้ใจทราบถึงการจับกุมที่สามารถดำเนินการได้โดยสะดวกและไม่เป็นการขัดขวางการจับหรือการควบคุมถูกจับ หรือทำให้เกิดความไม่ปลอดภัยแก่บุคคลหนึ่งบุคคลใด เจ้าพนักงานสามารถอนุญาตให้ผู้ถูกจับดำเนินการได้ตามสมควรแก่กรณี",
#         "ผู้ถูกจับทราบข้อกล่าวหาและสิทธิของผู้ถูกจับแล้วให้การ": "ผู้ถูกจับให้การรับว่าเคยใช้โปรแกรมทวิตเตอร์ ชื่อ  Hi Cool” และโปรแกรมทวิตเตอร์ ชื่อ  วัยรุ่นท่าขี้เหล็ก” ในการโพสต์ประกาศขายยาเสพติดจริง วิธีการโพสต์ รูปยาเสพติดทางโปรแกรมทวิตเตอร์ให้ลูกค้าที่สนใจต้องการซื้อยาเสพติด ติดต่อมาทางเฟสบุ๊คชื่อ  เกิดมาจน” และแอพพลิเคชั้นไลน์ของตนเองใช้ชื่อว่า  วัยรุ่น สมากั๊ก” ใช้โทรศัพท์มือถือยี่ห้อ หัวเหว่ย หมายเลข 095-979-1225 ของกลางลำดับที่ 3 ในการทำธุรกรรมโพสต์ข้อความขายยาเสพติดผ่านโปรแกรมทวิตเตอร์ แต่ตนเองได้ลบข้อมูลทวิตเตอร์ดังกล่าวไปแล้วขณะที่เจ้าหน้าที่ตำรวจเข้าตรวจจับกุม ตนเองได้โพสต์ประกาศขายยาเสพติดทางโปรแกรมทวิตเตอร์มาตั้งเดือนเมษายน 2563 ถึงช่วงเดือนพฤษภาคม 2563 และมีคนติดต่อเข้ามาซื้อจำนวนหลายราย บางครั้งก็มีการส่งยาเสพติดให้กับลูกค้าจริง และบางครั้งจะไม่ส่งยาเสพติดให้กับลูกค้าบ้างเป็นบางราย และเมื่อมีการตกลงซื้อขายยเสพติดแล้ว จะให้ลูกค้าโอนเงินค่ายาเสพติดเข้ามาในบัญชีธนาคารกสิกรไทย เลขบัญชี 7972293525 ชื่อบัญชีนายธนกร สุนทรชัย ของตนเองจริง และให้การยอมรับว่าเมื่อวันที่ 5 พฤษภาคม 2563 ตนได้ใช้ให้นายศุภกิตติ์ หรือบอส พวงสมบัติ ที่เป็นเพื่อนกันให้นำยาเสพติดประเภท 1 (ไอซ์) มาส่งให้กับเจ้าหน้าที่ตำรวจอำพรางล่อซื้อโดยนัดหมายให้ส่งมอบยาเสพติดที่บริเวณริมถนนลำลูกกา หน้าวัดสายไหม ตำบลคูคต อำเภอลำลูกกา จังหวัดปทุมธานี จริง โดยตนเองจะสั่งซื้อยาเสพติดผ่านโปรแกรมทวิตเตอร์ชื่อ  เจ้าอาร์ม” จะสั่งซื้อยาเสพติดประเภท 1 (ไอซ์) ครั้งละ 5 กรัม กรัมละ 500 บาท และนำยาเสพติดประเภท 1 (ไอซ์) มาจำหน่ายต่อให้กับลูกค้าที่สั่งซื้อในราคากรัมละ 700 บาท จริง และให้การว่าตนได้กระทำผิดตามข้อกล่าวหาว่าร่วมกันมียาเสพติดให้โทษประเภท 1 (ไอซ์หรือเมทแอมเฟตามีน) ไว้ในครอบครองเพื่อจำหน่ายและจำหน่ายโดยไม่ได้รับอนุญาต ตามหมายจับศาลอาญาฯ จริง",
#         "พร้อมของกลางดังนี้": "1. โทรศัพท์มือถือยี่ห้อซัมซุง (ไม่พบซิมการ์ด) จำนวน 1 เครื่อง 2. โทรศัพท์มือถือยี่ห้อแอปเปิล หมายเลข 0950105140จำนวน 1 เครื่อง 3. โทรศัพท์มือถือยี่ห้อ หัวเหว่ย หมายเลข 0959791225 จำนวน 1 เครื่อง",
#         "พฤติการณ์ในการจับกุม": "กล่าวคือวันนี้ 14 พฤษภาคม 2563 เวลาประมาณ 06.30 น. เจ้าหน้าที่ตำรวจกลุ่มงานการข่าว กองบังคับการข่าวกรองยาเสพติด กองบัญชาการตำรวจปราบปรามยาเสพติด ได้นำหมายค้นศาลอาญา ที่ 255/2563 ลงวันที่ 13 พฤษภาคม 2563 เข้าค้นบ้านเลขที่ 99/30 หมู่ที่ 3 หมู่บ้านพกบัณฑิตแลนด์ ตำบลคูคต อำภอลำลูกกา จังหวัดปทุมธานี ซึ่งมีนายธนกร สุนทรชัย บุคคลตามหมายจับของศาลอาญาที่ 200/2563 ลง 12 พฤษภาคม 2563 พักอาศัยอยู่ เมื่อไปถึงบ้านดังกล่าวได้พบกับนางสาววิจิตรา ทิมกล่ำ แสดงตัวเป็นเจ้าบ้าน เจ้าหน้าที่ตำรวจได้แสดงตัวเป็นเจ้าหน้าที่ตำรวจพร้อมแสดงหมายค้นให้นางสาววิจิตรา ทิมกล่ำ เจ้าบ้านดูและอ่านหมายค้นฟัง และให้อ่านหมายค้นเองจนเป็นที่เข้าใจ พร้อมแจ้งวัตถุประสงค์ในการตรวจค้น และได้ดำเนินการตรวจค้น เจ้าของบ้านนำการตรวจค้น ผลการตรวจค้นพบนายธนกร สุนทรชัย พักอาศัยอยู่ภายในบ้านดังกล่าวบริเวณห้องนอนชั้น 2 เจ้าหน้าที่ตำรวจชุดจับกุมจึงได้นำหมายค้นและหมายจับให้ดูและสอบถามว่าใช่นายนายธนกร สุนทรชัย บุคคลตามหมายจับหรือไม่ นายธนกร สุนทรชัย ยอมรับเป็นบุคคลตามหมายจับนี้จริงและยังไม่เคยถูกจับตามหมายจับนี้มาก่อน ผลการตรวจค้นพบโทรศัพท์ยี่ห้อซัมซุง ของกลางลำดับที่ 1 พบวางอยู่บนโต๊ะภายในห้องนอนของผู้ถูกจับ และโทรศัพท์มือถือยี่ห้อแอปเปิล รุ่นไอโฟน ของกลางลำดับ 2 พบวางอยู่ในห้องน้ำภายในบ้านของผู้ถูกจับ ,โทรศัพท์มือถือยี่ห้อ หัวเหว่ย ของกลางลำดับที่ 3 พบวางอยู่บนเตียงนอนของผู้ถูกจับ เจ้าหน้าที่ตำรวจชุดจับกุมจึงได้แจ้งข้อกล่าวหาและสิทธิ์ให้นายธนกร สุนทรชัย ผู้ถูกจับทราบและผู้ถูกจับทราบและเข้าใจข้อกล่าวหาดีแล้ว ผู้ถูกจับให้การรับตามคำให้การดังกล่าวข้างต้น เจ้าหน้าที่ตำรวจ จึงนำตัวผู้ต้องหาพร้อมของกลางดังกล่าวกลับมาที่ กลุ่มงานการข่าว บก.ขส.ฯ เพื่อทำบันทึกการตรวจค้น/จับกุม แล้วได้ทำประวัติและนำผู้ต้องหาพร้อมของกลางส่งพนักงานสอบสวน บช.ปส. เพื่อดำเนินการต่อไป",
#         "วัน เดือน ปี ที่จับกุม": "14 พฤษภาคม 2563 เวลา 07.30 น",
#         "วัน เดือน ปี ที่บันทึก": "14 พฤษภาคม 2563 เวลา 12.30 น",
#         "วัน เดือน ปี และสถานที่เกิดเหตุ": "วันที่ 24 เมษายน 2563 ถึงวันที่ 6 พฤษภาคม 2563 บริเวณริมถนนลำลูกกา หน้าวัดสายไหม ตำบลคูคต อำเภอลำลูกกา จังหวัดปทุมธานี ……................................................................          ผู้จับได้แจ้งให้ญาติหรือผู้ที่ผู้ถูกจับไว้ใจทราบแล้ว ……................................................................            ผู้จับไม่ประสงค์แจ้งให้ญาติหรือผู้ที่ผู้ถูกจับไว้ใจทราบ ……................................................................           ได้มอบสำเนาบันทึกจับกุมให้ผู้ถูกจับแล้ว อนึ่งในการตรวจค้นและจับกุมตัวในครั้งนี้ เจ้าหน้าที่ตำรวจชุดจับกุมมิได้ทำร้ายร่างกาย บังคับ ขู่เข็ญ หรือกระทำการใดๆ ให้เป็นอันตรายแก่กายหรือจิตใจ มิได้ทำให้ทรัพย์หรือสิ่งหนึ่งสิ่งใดเสียหาย สูญหาย หรือเสื่อมค่า ไร้ค่าแต่อย่างใด มิได้เรียกร้องเอาทรัพย์สินหรือประโยชน์อื่นใดมาเป็นของตนเอง หรือบุคคลที่สามแต่อย่างใด แล้วเจ้าหน้าที่ชุดจับกุมได้มอบสำเนาบันทึกจับกุมให้กับผู้ต้องหาไว้แล้ว  ได้อ่านบันทึกฉบับนี้ให้ผู้ต้องหาฟังและให้อ่านด้วยตนเองแล้ว รับว่าถูกต้องจึงให้ลงลายมือชื่อไว้เป็หลักฐาน  (ลงชื่อ)........................................................ผู้ถูกจับ/นำตรวจค้น/ได้รับสำเนาบันทึกจับกุมแล้ว (  นายธนกร หรือฟิว สุนทรชัย )  (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               \t ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)                \t               ผู้จับกุม   (ลงชื่อ)              \t    \tผู้จับกุม (ลงชื่อ)               \t               \t ผู้จับกุม   (ลงชื่อ)               \t             ผู้จับกุม /บันทึก/อ่าน",
#         "สถานที่จับกุม": "บ้านเลขที่ 99/30 หมู่ที่ 3 หมู่บ้านพกบัณฑิตแลนด์ ตำบลคูคต อำภอลำลูกกา จังหวัดปทุมธานี",
#         "สถานที่บันทึก": "กลุ่มงานการข่าว กองบังคับการข่าวกรองยาเสพติด กองบัญชาการตำรวจปราบปรามยาเสพติด",
#         "เจ้าหน้าที่ตำรวจ ศวข.กท.บก.ขส.บช.ปส.": "พ.ต.อ.จุมพล อินทลักษณะ ผกก.กลุ่มงานการข่าว, พ.ต.ท.อุดมรัตน์ อิทธิโสภาพันธุ์ รอง ผกก.กลุ่มงานการข่าว บก.ขส., พ.ต.ท.ธีรยุทธ อ่ำโพธิ์, พ.ต.ท.อำนาจ สุขจิต, พ.ต.ต.อิทธิกร สง่ากร, พ.ต.ต.วรวัตต์ อุดรรัตนา สว.กลุ่มงานการข่าว บก.ขส., ร.ต.อ.หญิง ปริยากร เสนาหนอก, ร.ต.อ.จิรวัฒน์ ภูงามตา, ร.ต.อ.ปิยะนัฐ ผลผลา, ร.ต.ท.ธนกร อธิสุขเมธา, ร.ต.อ.วันชัย ชูศักดิ์, ร.ต.ท.มงคล เพ็ชรรักษ์ รอง สว.กลุ่มงานการข่าว, ด.ต.วราวุฒิ วัฒนมาลา, ด.ต.อชิตพล ปะตังเวสา, ด.ต.หญิง ลาวัณย์ ปันเขื่อนขัติ, ด.ต.หญิง นารี อ้นมี, ส.ต.อ.สัณฐิติ ภู่บุบผา, ส.ต.อ.พุฒิพงศ์ เผ่าพันธุ์เจริญ, ส.ต.อ.ชาญชัย จันทร์หอม ,ส.ต.อ.ณัฐกร รัตนโชติ ผบ.หมู่ กลุ่มงานการข่าว บก.ขส.",
#         "เจ้าหน้าที่ตำรวจ ศวข.ชม.บก.ขส.บช.ปส.": "พ.ต.อ.ชิตภพ โตเหมือน ผกก.กลุ่มงานการข่าว, พ.ต.ท.ประเทือง แตงอ่อน รอง ผกก.กลุ่มงานการข่าว, พ.ต.ท.หญิง ณัฐภาวี เกตุภู่ รอง ผกก.ฯ ปฏิบัติหน้าที่ ศอ.ปส.ตร., พ.ต.ต.ธีรสิทธิ วิสุทธสิน, ว่าที่ พ.ต.ต.หญิง เขมณัฎฐ์ ชุตินันท์วินิจ สว.กลุ่มงานเทคโนโลยีฯ, ร.ต.อ.ทินกร บัณฑรวรรณ รอง สว.กลุ่มงานการข่าว, ด.ต.ชยาพล รักษาดี, ด.ต.หญิง ศรีไพร โศณณายะ, ด.ต.ชุมพล ถาวรเรืองฤทธิ์, ด.ต.พจน์ ทองอินทร์, ด.ต.หญิง คชาภรณ์ สังข์ศรี, ด.ต.ธนกฤต หงส์ฤทัย, ด.ต.พิทักษ์สันติ บุญเสนอ, ด.ต.เอกฤทัย เอี่ยมสะอาด, ด.ต.หญิง ภาวนา หงษ์ทอง, ด.ต.เอกชาย คำมูล, ด.ต.พิเชษฐ ดวงเกิด ผบ.หมู่ กลุ่มงานการข่าว บก.ขส.บช.ปส.",
#         "เจ้าหน้าที่ตำรวจ ศวข.สข.บก.ขส.บช.ปส. พ.ต.ท.วิฑูรย์ ญานุกูล รอง ผกก.กลุ่มงานการข่าว บก.ขส.,ว่าที่ พ.ต.ท.เอกราช จิตรอักษร สว.กลุ่มงานการข่าว บก.ขส.,ร.ต.อ.หญิงนงนุช": "ยิ้มแก้ว,ร.ต.อ.สุวิทย์ นิลวัตร รอง สว.กลุ่มงานการข่าว บก.ขส.,ว่าที่ ร.ต.ต.หญิง กมลทิพย์ ชูศรี รอง สว.(ป) กลุ่มงานการข่าว บก.ขส.,ด.ต.ทวีศักดิ์ อุ่นอำไพ ,ด.ต.มะรอนิง อาแว ,ส.ต.อ.อนุวัติ เฉลิมวรรณ ผบ.หมู่ กลุ่มงานการข่าว บก.ขส.",
#         "เจ้าหน้าที่ตำรวจ ศวข.อธ.บก.ขส.บช.ปส.": "พ.ต.อ.อรรถพร สุริยเลิศ ผกก.กลุ่มงานการข่าว, พ.ต.ต.อนุชา อินทร์บุญ สว.กลุ่มงานการข่าว,ร.ต.อ.อุดมการ บุตรเกตุ ,ร.ต.อ.สุวิทย์ แสนแก้ว รอง สว.กลุ่มงานการข่าว, ด.ต.ฐานิต กัณหา ,ส.ต.อ.อนุชาติ บุราณเดช ,ส.ต.อ.จักรพันธ์ คุ้มครอง ,ส.ต.อ.จักราวุฒิ บรรยง ผบ.หมู่ กลุ่มงานการข่าว",
#         "โดยกล่าวหาว่า": "ร่วมกันมียาเสพติดให้โทษประเภท 1 (ไอซ์หรือเมทแอมเฟตามีน)ไว้ในครอบครองเพื่อจำหน่ายและจำหน่ายโดยไม่ได้รับอนุญาต” ตามหมายจับศาลอาญาที่ 200/2563 ลง 12 พฤษภาคม 2563",
#         "ได้ร่วมกันทำการจับกุม": "นายธนกร หรือฟิว สุนทรชัย อายุ 24 ปี เลขประชาชน 1659900762854 ที่อยู่ 43 หมู่ที่ 3 ตำบลท่าตาล อำเภอบางกระทุ่ม จังหวัดพิษณุโลก"
#     }

# DocumentGenerate(d).generate()